004 Development/001 Implementation/e-TrustEx/etrustex-integration/src/test/resources/xquerytest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<ns16:Header xmlns="ec:schema:xsd:CommonAggregateComponents-2"
			xmlns:ns10="ec:services:wsdl:InboxRequest-2" xmlns:ns11="ec:services:wsdl:ApplicationResponse-2"
			xmlns:ns13="http://uri.etsi.org/01903/v1.3.2#" xmlns:ns14="ec:services:wsdl:RetrieveInterchangeAgreementsRequest-2"
			xmlns:ns15="ec:services:wsdl:QueryRequest-2" xmlns:ns16="ec:services:wsdl:DocumentBundle-2"
			xmlns:ns17="ec:services:wsdl:DocumentWrapper-2" xmlns:ns18="ec:services:wsdl:StatusRequest-2"
			xmlns:ns19="ec:services:wsdl:RetrieveRequest-2"
			xmlns:ns2="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
			xmlns:ns20="ec:schema:xsd:InboxResponse-2" xmlns:ns21="urn:oasis:names:specification:ubl:schema:xsd:Fault-1"
			xmlns:ns22="ec:schema:xsd:RetrieveRequest-2" xmlns:ns23="ec:schema:xsd:Ack-2"
			xmlns:ns24="ec:schema:xsd:DocumentWrapper-1" xmlns:ns25="ec:schema:xsd:RetrieveInterchangeAgreementsResponse-2"
			xmlns:ns26="http://uri.etsi.org/01903/v1.4.1#" xmlns:ns27="ec:schema:xsd:StatusResponse-2"
			xmlns:ns28="ec:schema:xsd:DocumentWrapperRequest-1" xmlns:ns29="ec:schema:xsd:RetrieveInterchangeAgreementsRequest-2"
			xmlns:ns3="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2"
			xmlns:ns30="ec:schema:xsd:DocumentBundle-1" xmlns:ns31="ec:schema:xsd:InboxRequest-2"
			xmlns:ns32="urn:oasis:names:specification:ubl:schema:xsd:ApplicationResponse-2"
			xmlns:ns33="ec:schema:xsd:QueryRequest-2" xmlns:ns34="ec:schema:xsd:StatusRequest-2"
			xmlns:ns35="ec:schema:xsd:RetrieveResponse-2" xmlns:ns36="ec:schema:xsd:QueryResponse-2"
			xmlns:ns4="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
			xmlns:ns5="ec:schema:xsd:CommonBasicComponents-1" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns7="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader"
			xmlns:ns8="urn:oasis:names:specification:ubl:schema:xsd:SignatureBasicComponents-2"
			xmlns:ns9="urn:oasis:names:specification:ubl:schema:xsd:SignatureAggregateComponents-2"
			xmlns:xmime="http://www.w3.org/2005/05/xmlmime">
			<BusinessHeader>
				<ns7:Sender>
					<ns7:Identifier>ACC-EDMA-APP-PARTY</ns7:Identifier>
				</ns7:Sender>
				<ns7:Receiver>
					<ns7:Identifier>ACC-EDMA-WEB3-PARTY</ns7:Identifier>
				</ns7:Receiver>
			</BusinessHeader>
			<TechnicalHeader>
				<ns9:SignatureInformation>
					<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
						<SignedInfo>
							<CanonicalizationMethod
								Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#WithComments" />
							<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
							<Reference URI="">
								<Transforms>
									<Transform
										Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
									<Transform Algorithm="http://www.w3.org/2002/06/xmldsig-filter2">
										<XPath Filter="intersect"
											xmlns="http://www.w3.org/2002/06/xmldsig-filter2"
											xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">//SOAP-ENV:Envelope/SOAP-ENV:Header/ns16:Header
										</XPath>
									</Transform>
								</Transforms>
								<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
								<DigestValue>LlaBKU9sfYpZvxJdFe2g3he50/I=</DigestValue>
							</Reference>
							<Reference URI="">
								<Transforms>
									<Transform Algorithm="http://www.w3.org/2002/06/xmldsig-filter2">
										<XPath Filter="intersect"
											xmlns="http://www.w3.org/2002/06/xmldsig-filter2"
											xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">//SOAP-ENV:Envelope/SOAP-ENV:Body/*[1]</XPath>
									</Transform>
								</Transforms>
								<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
								<DigestValue>N67z/Le8+hT2L8mQz9oMmck9Mw8=</DigestValue>
							</Reference>
						</SignedInfo>
						<SignatureValue>ddUI8aiXn0l+/pV65Lztr+BIj7Uk6zM5FLeWWp92VigMBK7oerAoAdH2G6DdCTHXVn3jwmxjHgtX
							C0p5fewhAE/V9wcDmhZO9qM6w4Q4CqvCyQNrZehN1kgjAi6E5tuKGzSHOEfvcsznprAtCne1aY1r
							QvD8MwNz9uCfpNvA3EEeONaQQ2hgjBqh/kPe6QiA3ru79U8s8zqt5YEVjvLHtBlPNVR+MMkAKdFH
							zoRWNVZfQaMn/iveiBT1CBIJRtkSPCpqH9YYHc8VBho7IUfBtLreNCja6ANsLBuIRZS+/JgoZewR
							ovhW+fe3E/6CGw9t+n2cDHBHXXXcDiGb4gxRbg==</SignatureValue>
						<KeyInfo>
							<X509Data>
								<X509SubjectName>CN=EDMA to NodeACC,OU=European
									Commission,O=DIGIT B1,ST=Bruxelles,C=BE</X509SubjectName>
								<X509Certificate>MIIDVTCCAj2gAwIBAgIFATRv+64wDQYJKoZIhvcNAQENBQAwbDELMAkGA1UEBhMCQkUxEjAQBgNV
									BAgMCUJydXhlbGxlczERMA8GA1UECgwIRElHSVQgQjExHDAaBgNVBAsME0V1cm9wZWFuIENvbW1p
									c3Npb24xGDAWBgNVBAMMD0VETUEgdG8gTm9kZUFDQzAeFw0xMzA2MjAxMTE1NTVaFw0xODA2MjAx
									MTE1NTVaMGwxCzAJBgNVBAYTAkJFMRIwEAYDVQQIDAlCcnV4ZWxsZXMxETAPBgNVBAoMCERJR0lU
									IEIxMRwwGgYDVQQLDBNFdXJvcGVhbiBDb21taXNzaW9uMRgwFgYDVQQDDA9FRE1BIHRvIE5vZGVB
									Q0MwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCK1HEZ4yApxorg+fp4g1Jr9q/H8rJb
									ddQtQnB8o8QMlgWq3tlD7S6FnXoZtQAehp8H9v6GCzem+eg1g0TPwtChuts/hfotX7Yulm1K0xCM
									nj0VdNNms8I1YaSJCJxxyrJqTZllgKci8/a/lpzzDyZGDS0rQZ2louA4TKZV+3rwFwovJCWEMCEa
									J4JNeLU9oIJ8gAk/IEGG2bpPLlyaI4l4Ji6ey/nYLxe+Rc3TNa5M5JT7cTOFard3gyk2JzAOgUuW
									YSNiyI4TZmOKhoaV4JgMge6UjhjxU1+b7LzPn9beddTMnzxkQ3qjOvOaGEyqe7AfD6e/GgNgP2wV
									BsxCRUM7AgMBAAEwDQYJKoZIhvcNAQENBQADggEBAFtvpZNUZKtHOLM2jGrFZP2hBS/25fhrJgxQ
									3G1E5q6AJ8i6tplnr5Xqd2nD3/tUcaxejRhPFK3rwgs/mkczXA2X3pehO+AbUoTg+0Xy1GMy3Zj8
									cYhybVY8uPh3upsESoGEz3hMinzF/1rdX+BjYjEI5TIHCfWTLu6kxOFmTDjTZPKH0homtaqJyDtE
									qNE+HoIYo8tAaVoTCzrzOy/UqEd9jjmf0cFJqkvgagIvLuMGVYRYBh8oHwQBCZCbro2FB2AT1b5s
									ITkU+Tr1N/QzTDMEOQF2qwx4ZXxLy9Mjns3Ux3lEq0tu33uLa5Ndn09AnQ7dZOnuq5haM1b0GoKE
									0AQ=</X509Certificate>
							</X509Data>
						</KeyInfo>
					</Signature>
				</ns9:SignatureInformation>
			</TechnicalHeader>
		</ns16:Header>
	</soap:Header>
	<soap:Body>
		<ns16:SubmitDocumentBundleRequest
			xmlns="ec:schema:xsd:CommonAggregateComponents-2" xmlns:ns10="ec:services:wsdl:InboxRequest-2"
			xmlns:ns11="ec:services:wsdl:ApplicationResponse-2" xmlns:ns13="http://uri.etsi.org/01903/v1.3.2#"
			xmlns:ns14="ec:services:wsdl:RetrieveInterchangeAgreementsRequest-2"
			xmlns:ns15="ec:services:wsdl:QueryRequest-2" xmlns:ns16="ec:services:wsdl:DocumentBundle-2"
			xmlns:ns17="ec:services:wsdl:DocumentWrapper-2" xmlns:ns18="ec:services:wsdl:StatusRequest-2"
			xmlns:ns19="ec:services:wsdl:RetrieveRequest-2"
			xmlns:ns2="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
			xmlns:ns20="ec:schema:xsd:InboxResponse-2" xmlns:ns21="urn:oasis:names:specification:ubl:schema:xsd:Fault-1"
			xmlns:ns22="ec:schema:xsd:RetrieveRequest-2" xmlns:ns23="ec:schema:xsd:Ack-2"
			xmlns:ns24="ec:schema:xsd:DocumentWrapper-1" xmlns:ns25="ec:schema:xsd:RetrieveInterchangeAgreementsResponse-2"
			xmlns:ns26="http://uri.etsi.org/01903/v1.4.1#" xmlns:ns27="ec:schema:xsd:StatusResponse-2"
			xmlns:ns28="ec:schema:xsd:DocumentWrapperRequest-1" xmlns:ns29="ec:schema:xsd:RetrieveInterchangeAgreementsRequest-2"
			xmlns:ns3="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2"
			xmlns:ns30="ec:schema:xsd:DocumentBundle-1" xmlns:ns31="ec:schema:xsd:InboxRequest-2"
			xmlns:ns32="urn:oasis:names:specification:ubl:schema:xsd:ApplicationResponse-2"
			xmlns:ns33="ec:schema:xsd:QueryRequest-2" xmlns:ns34="ec:schema:xsd:StatusRequest-2"
			xmlns:ns35="ec:schema:xsd:RetrieveResponse-2" xmlns:ns36="ec:schema:xsd:QueryResponse-2"
			xmlns:ns4="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
			xmlns:ns5="ec:schema:xsd:CommonBasicComponents-1" xmlns:ns6="http://www.w3.org/2000/09/xmldsig#"
			xmlns:ns7="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader"
			xmlns:ns8="urn:oasis:names:specification:ubl:schema:xsd:SignatureBasicComponents-2"
			xmlns:ns9="urn:oasis:names:specification:ubl:schema:xsd:SignatureAggregateComponents-2"
			xmlns:xmime="http://www.w3.org/2005/05/xmlmime">
			<ns16:DocumentBundle>
				<ns3:UBLExtensions>
					<ns3:UBLExtension>
						<ns2:ID>signature</ns2:ID>
						<ns3:ExtensionContent>
							<valueElement xmlns=""
								xmlns:ns37="ec:schema:xsd:CommonAggregateComponents-2"><![CDATA[<?xml version="1.0" encoding="UTF-8"?><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="xmldsig-1bca3860-c170-402a-b53d-149c086777d1">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
<ds:Reference Id="xmldsig-1bca3860-c170-402a-b53d-149c086777d1-ref0">
<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
<ds:DigestValue>nGxXuFJ4KDZONJ6r0riQVY79VHaSJunMWU3r9yIEBNI=</ds:DigestValue>
</ds:Reference>
<ds:Reference Type="http://uri.etsi.org/01903#SignedProperties" URI="#xmldsig-1bca3860-c170-402a-b53d-149c086777d1-signedprops">
<ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
<ds:DigestValue>zYeJ8MEvQ+83TVfjXqGjZYRfZ/AhDj6RtsBTiGFj62k=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue Id="xmldsig-1bca3860-c170-402a-b53d-149c086777d1-sigvalue">
OdqQp5ooMDBRa2amwPP5q47EzoGFUPdnK1FEVyQ3PA9Ru82Nr1axgrltNViPMvEugCO05d+TTUlm
XiWw0M9zkZGTC3wY7j5L734oI6/SEvfTCXiFr7GXtZLEp2BulssIwUwz4S5Dbt2Sw7dO07UPLt87
ngj3N5FkU+cVDGaRLja51ElZYgYTN1tfk6Zlp8GCWKteatMbiFXrv2be7f0hHajiH+otj8Bl7ijC
OM83geyDM1/sp02Jw0+Bjai/6L+8tyZ48YFvE7MJcRFtzfmHcHRXhEiJ6bcDKgolzUFQ37do6sDC
zT8w3QGjUZ3fWPiXtWHiQ7Jbm3y+Ud1a5yYAnA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:X509Data>
<ds:X509Certificate>
MIIDVjCCAj6gAwIBAgIEUCz3FDANBgkqhkiG9w0BAQUFADBtMQswCQYDVQQGEwJCRTERMA8GA1UE
CBMIQnJ1c3NlbHMxETAPBgNVBAcTCEJydXNzZWxzMQswCQYDVQQKEwJFQzEQMA4GA1UECxMHQ09N
UC5SMzEZMBcGA1UEAxMQUmF2c2hhbiBLaGFtaWRvdjAeFw0xMjA4MTYxMzM1MTZaFw0xNDA4MTYx
MzM1MTZaMG0xCzAJBgNVBAYTAkJFMREwDwYDVQQIEwhCcnVzc2VsczERMA8GA1UEBxMIQnJ1c3Nl
bHMxCzAJBgNVBAoTAkVDMRAwDgYDVQQLEwdDT01QLlIzMRkwFwYDVQQDExBSYXZzaGFuIEtoYW1p
ZG92MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAideuk42Wr5E5VzZ/UOKJDXSeABNp
OreKYZy7E1Eu5HHZSlr3bdvgY24ejZG+5qrybF1jVymYIKuJildRXmgbnBNX2fmarFwgYsCGlUcp
0rQ0RMWKC6c10JZWmHn4AdGenmz3reUJ/rBDmfkSBa1GkClvydaOfWE9jRrtJUHQy3vWX9UJ3PqL
wZmlOQKvmQEetm1/XkU0Ksbr97K/7Za5r+z6nXmFsdYyNmKMTXiaBjxoLdG2MxVq94UhtDY3mCHz
OVGQF3QymBOqCCebV+7hjrPaOWz8CKXsc7gXFtzN9Rz6V51yGG2JJqYxSnAn9+dwkc3ermwDJldE
gLh38XcrxwIDAQABMA0GCSqGSIb3DQEBBQUAA4IBAQA3+nZNMtLO1+QgaTW4ltyclvSiIiZi6ibr
5wsr2Ftg70bIJ4AJX3/r8PxfB0Pws8JZwW3neWATc3srb5PrnHb5OOf+Hv087KqliFWduk/Bs5OQ
71rWsQwPHML4A99BKveM68DGSfWrcuIaWOCUbg8Pe1YrdPZSSF+6losEkUQMZz3NMfttdUhMQLjU
tSWHndK/DGlEn8HSXvH7oOg/Rp19jEYeBqdeo49XJtOXEE/hAaQWGz7ezUUmp+W9xAGQGGd1yxUw
EPItedVjnxM6GedUeb1D5YWgwAFBvFoxcjReYxKdsj5KbXeSW+vggwgy40b2vyD9RD5lTGvET1EE
bz3v
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
<ds:Object><xades:QualifyingProperties xmlns:xades="http://uri.etsi.org/01903/v1.3.2#" xmlns:xades141="http://uri.etsi.org/01903/v1.4.1#" Target="#xmldsig-1bca3860-c170-402a-b53d-149c086777d1"><xades:SignedProperties Id="xmldsig-1bca3860-c170-402a-b53d-149c086777d1-signedprops"><xades:SignedSignatureProperties><xades:SigningTime>2013-07-08T14:38:59.493+02:00</xades:SigningTime><xades:SigningCertificate><xades:Cert><xades:CertDigest><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><ds:DigestValue>tsNnJgoq0lxOUHFJDawXu13XLdd0TRpoklwMWiPKhwo=</ds:DigestValue></xades:CertDigest><xades:IssuerSerial><ds:X509IssuerName>CN=Ravshan Khamidov,OU=COMP.R3,O=EC,L=Brussels,ST=Brussels,C=BE</ds:X509IssuerName><ds:X509SerialNumber>1345124116</ds:X509SerialNumber></xades:IssuerSerial></xades:Cert></xades:SigningCertificate></xades:SignedSignatureProperties></xades:SignedProperties></xades:QualifyingProperties></ds:Object>
</ds:Signature>]]></valueElement>
						</ns3:ExtensionContent>
					</ns3:UBLExtension>
					<ns3:UBLExtension>
						<ns2:ID>signedData</ns2:ID>
						<ns3:ExtensionContent>
							<valueElement xmlns=""
								xmlns:ns37="ec:schema:xsd:CommonAggregateComponents-2"><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?><signedBundle xmlns="urn:eu:europa:ec:etrustex:signature:v1.0"><document><id>ACC-EDMA-APP-PARTY_ATT_1756_1</id><digestMethod>SHA-512</digestMethod><digestValue>c5ebfc3105c6544b6944b7c48e13abbf2cf86a54b36c658a948e7084f177281f51a9e8524b4bb689f124328df2b5dbcf5512716ca79f7f58d6269b77</digestValue></document><document><id>ACC-EDMA-APP-PARTY_ATT_1756_2</id><digestMethod>SHA-512</digestMethod><digestValue>5d6b908276d2509b1751d29ec4e7dadc464f7fd341287fad1d912c6968839bdf6fe1ff59a7bda142426f62151de3fbc50735759a7fc74e22b294cdf5bc1</digestValue></document><document><id>ACC-EDMA-APP-PARTY_ATT_1756_3</id><digestMethod>SHA-512</digestMethod><digestValue>4d36c93c53defb798188139289b35dd9476e447c972cb274a35c9751262c3f1d71688e4d23f162376cad457c56f7da93b4218d237c3dbdb833c74cc68669</digestValue></document><document><id>ACC-EDMA-APP-PARTY_ATT_1756_4</id><digestMethod>SHA-512</digestMethod><digestValue>c15f4aeb5119c732528d1ec4b74d57ea66aa46e2733a2f6291eb0d13dfbe9adaeefc9d0e8b7ded435aebd59cf3a3057a1a01ac5529b3ef324762bb27bd1</digestValue></document></signedBundle>]]></valueElement>
						</ns3:ExtensionContent>
					</ns3:UBLExtension>
				</ns3:UBLExtensions>
				<ns2:ProfileID>test new questionnaires</ns2:ProfileID>
				<ns2:ID>1756</ns2:ID>
				<ns2:IssueDate>2013-06-25</ns2:IssueDate>
				<ns2:IssueTime>00:00:00.000</ns2:IssueTime>
				<ns2:Note>Questionnaire</ns2:Note>
				<ns4:SenderParty>
					<ns2:EndpointID>ACC-EDMA-APP-PARTY</ns2:EndpointID>
				</ns4:SenderParty>
				<ns4:ReceiverParty>
					<ns2:EndpointID>ACC-EDMA-WEB3-PARTY</ns2:EndpointID>
				</ns4:ReceiverParty>
				<DocumentWrapperReference>
					<ns2:ID>ACC-EDMA-APP-PARTY_ATT_1756_1</ns2:ID>
					<ns2:DocumentTypeCode>BINARY</ns2:DocumentTypeCode>
					<ResourceInformationReference>
						<ns2:Name>LegalBases.pdf</ns2:Name>
						<DocumentSize>151697</DocumentSize>
						<DocumentHashMethod>SHA-512</DocumentHashMethod>
						<ns2:DocumentHash>0C5EBFC3105C6544B6944B7C48E13A0BBF2CF806A504B36C658A948E7084F177281F51A9E85204B4BB0689F124328DF2B5DBCF550127016CA79F7F58D6269B77
						</ns2:DocumentHash>
					</ResourceInformationReference>
				</DocumentWrapperReference>
				<DocumentWrapperReference>
					<ns2:ID>ACC-EDMA-APP-PARTY_ATT_1756_2</ns2:ID>
					<ns2:DocumentTypeCode>BINARY</ns2:DocumentTypeCode>
					<ResourceInformationReference>
						<ns2:Name>Recipients.pdf</ns2:Name>
						<DocumentSize>22661</DocumentSize>
						<DocumentHashMethod>SHA-512</DocumentHashMethod>
						<ns2:DocumentHash>5D6B908276D2509B1751D29EC40E7DAD0C464F7FD341287FAD1D912C69068839BDF6FE1FF59A7BDA142426F621510DE3FBC500735759A7FC74E22B294CDF5BC1
						</ns2:DocumentHash>
					</ResourceInformationReference>
				</DocumentWrapperReference>
				<DocumentWrapperReference>
					<ns2:ID>ACC-EDMA-APP-PARTY_ATT_1756_3</ns2:ID>
					<ns2:DocumentTypeCode>BINARY</ns2:DocumentTypeCode>
					<ResourceInformationReference>
						<ns2:Name>Questionnaire.pdf</ns2:Name>
						<DocumentSize>27082</DocumentSize>
						<DocumentHashMethod>SHA-512</DocumentHashMethod>
						<ns2:DocumentHash>04D36C93C53DEFB798188139289B035DD9476E447C972CB274A35C9751262C3F1D71688E4D23F162376CAD457C56F7DA093B4218D237C3DBDB833C74CC068669
						</ns2:DocumentHash>
					</ResourceInformationReference>
				</DocumentWrapperReference>
				<DocumentWrapperReference>
					<ns2:ID>ACC-EDMA-APP-PARTY_ATT_1756_4</ns2:ID>
					<ns2:DocumentTypeCode>BINARY</ns2:DocumentTypeCode>
					<ResourceInformationReference>
						<ns2:Name>CoverLetters.pdf</ns2:Name>
						<DocumentSize>127698</DocumentSize>
						<DocumentHashMethod>SHA-512</DocumentHashMethod>
						<ns2:DocumentHash>C15F04AEB5119C7302528D1EC4B704D57EA66AA46E2733A2F6291EB0D13DFBE9ADAEEFC9D0E8B7DED435AEBD59CF3A3057A1A01AC5529B3EF3240762BB27BD01
						</ns2:DocumentHash>
					</ResourceInformationReference>
				</DocumentWrapperReference>
				<DocumentWrapperReference>
					<ns2:ID>ACC-EDMA-APP-PARTY_ATT_1756_5</ns2:ID>
					<ns2:DocumentTypeCode>METADATA</ns2:DocumentTypeCode>
					<ResourceInformationReference>
						<ns2:Name>bundle_metadata_1756.xml</ns2:Name>
						<DocumentSize>1795</DocumentSize>
						<DocumentHashMethod>SHA-512</DocumentHashMethod>
						<ns2:DocumentHash>BB1CAB42318A0090DBCD3EB0DC26BE498C40BE692ECF4A59AD03C2955B0C0A1FF785852A9EB647D9832A97610E91806EAAD22695A8E972B10FE93EBA8A0108B5
						</ns2:DocumentHash>
					</ResourceInformationReference>
				</DocumentWrapperReference>
			</ns16:DocumentBundle>
		</ns16:SubmitDocumentBundleRequest>
	</soap:Body>
</soap:Envelope>
